Feature: account

Scenario: Δημιουργία λογαριασμού
         Given ότι δεν έχω λογαριασμό και θέλω να δημιουργήσω
         When είμαι στη σελίδα δημιουργίας λογαριασμού
         And βάζω e-mail, username και κωδικό
         And το mail και το username δεν υπάρχουν ήδη στο σύστημα
         Then γίνεται επιτυχής δημιουργία λογαριασμού
         
Scenario:Αποτυχία δημιουργίας λογαριασμού
         Given ότι δεν έχω λογαριασμό και θέλω να δημιουργήσω
         When είμαι στη σελίδα δημιουργίας λογαριασμού
         And βάζω e-mail,username και κωδικό
         And το e-mail ή και το username  υπάρχουν ήδη στο σύστημα 
         Then ο λογαριασμός δεν δημιουργείται
         And εμφανίζεται μήνυμα "Το username χρησιμοποιήται"ή "Υπάρχει ήδη λογαριασμός με αυτό το e-mail"
         And εμφανίζεται μήνυμα "Προσπαθήστε ξανά"
         And έχω την επιλογή να δοκιμάσω πάλι να δημιουργήσω λογαριασμό
         
Scenario:login(είσοδος)
         Given οτι έχω λογαριασμό
         When βάζω το username μου και τον κωδικό
         And είναι σωστά
         Then γίνεται επιτυχής είσοδος 
         And εμφανίζεται η αρχική μου σελίδα 
         
Scenario:Αποτυχία εισόδου
        When βάζω το username  και τον κωδικό
        And den είναι σωστά
        Then δεν γίνεται είσοδος
        And εμφανίζεται μήνυμα "Λάθος username ή κωδικός, προσπαθηστε ξανά"
        And έχω την επιλογή να προσπαθήσω ξανά να εισέλθω
        
 Scenario: Είσοδος με facebook
         Given οτι έχω λογαριασμο στο facebook
         When είμαι στη σελίδα δημιουργίας λογαριασμού
         And πατήσω την επιλογή "Σύνδεση με facebook"
         Τhen συνδέομαι στην εφαρμογή με τα στοιχεία που έχω στο facebook
         And εμφανίζεται η αρχική μου σελίδα
         
         
