Feature: Recomment video

Scenario:Προταση βίντεο σε φίλο
        Given ότι είμαι συνδεδεμένος
        And ότι έχω ένα χρήστη φίλο
        When στέλνω πρόταση βίντεο σε ένα φίλο
        Then εμφανίζεται μήνυμα "Η πρόταση στάλθηκε"
        And η πρόταση έχει αποσταλεί στο φίλο
        
 Scenario:Αποδοχή πρότασης από φίλο
         Given ότι είμαι συνδεδεμένος
         And ότι ένας φίλος μου πρέτεινε ένα βίντεο
         When επιλέξω να δω την πρόταση
         Then έχω την επιλογή να παρακολουθήσω το βίντεο που μου προτεινε
         And έχω την επιλογή να διαφράψω την πρόταση
 
