Feature:search

Scenario:Αναζήτηση
        When κάνω αναζήτηση πληκτρόλογόντας κατηγορίες,υποκατηγορίες και λεξεις-κλειδιά στη μπάρα αναζήτησης στη κεντρική σελίδα
        Then στη σελίδα με τα αποτελέσματα αναζήτησης εμφανίζονται βίντεο που ανήκουν στις κατηγορίες και υποκατηγορίες που πληκτρολόγησα
        And μπορώ να επιλέξω ένα βίντεο για παρακολούθηση
        
Scenario:Αναζήτηση χωρίς αποτελέσματα
        When κάνω αναζήτηση πληκτρόλογόντας κατηγορίες,υποκατηγορίες και λέξεις-κλειδιά στη μπάρα αναζήτησης στη κεντρική σελίδα
        And δεν υπάρχουν συμβατά αποτελέσματα
        Then  στη σελίδα με τα αποτελέσματα αναζήτησης εμφανίζεται το μήνυμα "Δε βρέθηκαν αποτελέσματα"
        
Scenario:Αναζήτηση από το μενού
       Given ότι το μενού περιέχει τις πιο δημοφιλείς κατηγορίες
       When επιλέγω το μενου
       And επιλέγω μία από τις κατηγορίες
       Then εμφανίζονται βίντεο που ανήκουν σε αυτή τη κατηγορία
       And μπορώ να επιλέξω ένα βίντεο για παρακολούθηση
       And εμφανίζονται προτάσεις για υποκατηγορίες που μπορεί να με ενδιαφέρουν για αναζήτηση
       And μπορώ να επιλέξω μια υποκατηγορία για αναζήτηση
       
