Feature: sort by

Scenario:Ταξινόμηση κτά αριθμό eye
        Given ότι είμαι συνδεδεμένος
        When επιλέγω ταξινόμηση με βάση τον αρίθμό τον αριθμό των eye
        Τhen στην αρχική σελίδα εμφανίζονται πρώτα τα βίντεο με τα πιο πολλά eye
        Αnd στα αποτελέσματα αναζήτησης εμφανίζονται πρώτα  τα βίντεο με τα πιο πολλά eye
        
Scenario:Ταξινόμηση κατά αριθμό picks
        Given ότι είμαι συνδεδεμένος
        When επιλέγω ταξινόμηση με βάση τον αρίθμό τον αριθμό των picks
        Τhen στην αρχική σελίδα εμφανίζονται πρώτα τα βίντεο με τα πιο πολλά picks
        Αnd στα αποτελέσματα αναζήτησης εμφανίζονται πρώτα  τα βίντεο με τα πιο πολλά picks
       
 Scenario:Ταξινόμηση κατά αριθμό views
        Given ότι είμαι συνδεδεμένος
        When επιλέγω ταξινόμηση με βάση τον αρίθμό τον αριθμό των views
        Τhen στην αρχική σελίδα εμφανίζονται πρώτα τα βίντεο με τα πιο πολλά views
        Αnd στα αποτελέσματα αναζήτησης εμφανίζονται πρώτα  τα βίντεο με τα πιο πολλά views      
        
        
 
        
